/*
*********************************************************************************************************
*                                                uC/OS-II
*                                          The Real-Time Kernel
*
*                           (c) Copyright 1992-2002, Jean J. Labrosse, Weston, FL
*                                           All Rights Reserved
*
*                                               EXAMPLE #1
*********************************************************************************************************
*/

#include "../source/includes.h"

/*
*********************************************************************************************************
*                                               CONSTANTS
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                               VARIABLES
*********************************************************************************************************
*/

OS_STK   xdata     TaskStk[TASK_STK_SIZE];        /* Tasks stacks，放在xdata里。  						  */
OS_STK   xdata     Task1Stk[TASK_STK_SIZE];        /* Tasks stacks，放在xdata里。                           */

/*
*********************************************************************************************************
*                                           FUNCTION PROTOTYPES
*********************************************************************************************************
*/

void  Task(void *data1) RUNSISI_LARGE_REENTRANT;                       /* Function prototypes of tasks                  */
void  Task1(void *data1) RUNSISI_LARGE_REENTRANT;                       /* Function prototypes of tasks                  */
void InitTimer0();

/*$PAGE*/
/*
*********************************************************************************************************
*                                                MAIN
*********************************************************************************************************
*/

void  main (void)
{
    OSInit();                                              /* Initialize uC/OS-II                      */
	InitTimer0();   //启动定时器0
	OSTaskCreate(Task,0, &TaskStk[0],4);			  //创建任务函数Task的任务，参数依次为函数指针（即函数名），函数的参数，任务栈，优先级。
	OSTaskCreate(Task1,0, &Task1Stk[0],5);			  //创建任务函数Task1的任务，参数依次为函数指针（即函数名），函数的参数，任务栈，优先级。
    OSStart();                                             /* Start multitasking                       */
}


/*
*********************************************************************************************************
*                                              STARTUP TASK
*********************************************************************************************************
*/

void  Task(void *data1) RUNSISI_LARGE_REENTRANT
{
while(1)
{
static char xdata temp=0;
OSTimeDlyHMSM(0,0,1,0); //延时大约1s
P1^=0x2;
temp++;
}

}

void  Task1(void *data1) RUNSISI_LARGE_REENTRANT
{
while(1)
{
static char xdata temp=0;
OSTimeDlyHMSM(0,0,10,0); //延时大约10s
P1^=0x1;
temp++;
}

}


void InitTimer0() //初始化定时0，操作系统核心中断
{
	TMOD &= 0xf0;
	TMOD |= 0x01;
	TH0 = 0xb1;
	TL0 = 0xe0;
	ET0 = 1;
	TR0 = 1;
	EA=1;
}